src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныУслуг</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.Места</types>
        <types>CatalogRef.Ряды</types>
        <types>CatalogRef.Площадки</types>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныУслуг/ЦеныУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/УстановкаЦен/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ЦеныУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги из Услуги Цикл
		
		Движение = Движения.ЦеныУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Территория = Территория;
		Движение.Площадка = ТекСтрокаУслуги.Объект;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Цена = ТекСтрокаУслуги.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
